from PyQt6.QtCore import QObject, pyqtSignal

import os

# Потоковый обработчик взаимодейтсвий с библиотекой pornhub_dl.
class pornhub_dl(QObject):

	#==========================================================================================#
	# >>>>> СВОЙСТВА <<<<< #
	#==========================================================================================#

	# Сигнал: завершение потока. Содержит: завершающий код вызова библиотеки.
	finished = pyqtSignal(int)
	# Исполняемая команда.
	__Command = None

	#==========================================================================================#
	# >>>>> МЕТОДЫ <<<<< #
	#==========================================================================================#

	# Конструктор: задаёт команду для выполнения.
	def __init__(self, Command: str):
		# Обеспечение доступа к оригиналам наследованных методов.
		super().__init__()

		#---> Генерация свойств.
		#==========================================================================================#
		self.__Command = Command

	# Запускает выполнение команды.
	def run(self):

		# Если обнаружена скомпилированная версия библиотеки, подставить её в команду.
		if os.path.exists("pornhub_dl.exe"):
			self.__Command = self.__Command.replace("pornhub_dl.py", "pornhub_dl.exe")

		# Выполнение команды.
		ExitCode = os.system(self.__Command)
		# Генерация сигнала с завершающим кодом приложения.
		self.finished.emit(ExitCode)