from PyQt6.QtCore import pyqtSignal
from PyQt6.QtWidgets import QLabel

# Контейнер рекламной анимации.
class QLabelAdvertisement(QLabel):

    #==========================================================================================#
	# >>>>> СВОЙСТВА <<<<< #
	#==========================================================================================#

    # Сигнал: надпись кликнули мышью.
    clicked = pyqtSignal()

    #==========================================================================================#
	# >>>>> МЕТОДЫ <<<<< #
	#==========================================================================================#

    # Обрабатывает нажатие мышью.
    def mousePressEvent(self, Value):
        # Генерация сигнала.
        self.clicked.emit()